<?php

    //===========================================================================ファイルのロード
    require_once('./classes/Human.php');
    require_once('./classes/Enemy.php');
    require_once('./classes/Brave.php');
    //===========================================================================ここまで ファイルのロード

    //===========================================================================インスタンス化
    $kamoshida = new Brave();
    $freeza = new Enemy();
    //===========================================================================ここまで インスタンス化

    //===========================================================================プロパティを参照し、値を設定
    $kamoshida->name = 'カモシダ';
    $freeza->name = 'フリーザ';
    //===========================================================================ここまで プロパティの参照と値の設定

    //===========================================================================その他の値を設定
    $turn = 1;
    //===========================================================================ここまで その他の値を設定

    //===========================================================================戦闘
    echo "==========戦闘開始========== \n";

    while ($kamoshida->hitPoint > 0 && $freeza->hitPoint > 0) {

        echo "--------------------". $turn ."ターン目 \n";

        //現在のHPの表示
        echo $kamoshida->name ." HP ". $kamoshida->hitPoint ."/". $kamoshida::MAX_HITPOINT ."\n";
        echo $freeza->name ." HP ". $freeza->hitPoint ."/". $freeza::MAX_HITPOINT ."\n";
        //ここまで 現在のHPの表示
        echo "\n";

        //お互いの攻撃
        $kamoshida->doAttack($freeza); //カモシダの攻撃
        echo "\n";
        $freeza->doAttack($kamoshida); //フリーザの攻撃
        //ここまで お互いの攻撃
        echo "\n";

        $turn++;
    }
    //=============================================================================ここまで 戦闘

    echo "==========戦闘終了========== \n";

    //現在のHPの表示
    echo $kamoshida->name ." HP ". $kamoshida->hitPoint ."/". $kamoshida::MAX_HITPOINT ."\n";
    echo $freeza->name ." HP ". $freeza->hitPoint ."/". $freeza::MAX_HITPOINT ."\n";
    //ここまで 現在のHPの表示
    echo "\n";


?>