<?php

    class Enemy
    {
        //=======================================================================プロパティを定義
        const MAX_HITPOINT = 50;
        public $name;
        public $hitPoint = 50;
        public $attackPoint = 10;
        //=======================================================================ここまでプロパティの定義

        //=======================================================================攻撃メソッドの定義
        public function doAttack($target)
        {
            //メッセージ
            echo $this->name ."の攻撃". "\n";
            echo $target->name ."に". $this->attackPoint ."のダメージ". "\n";
            //ここまでメッセージ
            
            $target->tookDamage($this->attackPoint);
        }
        //=======================================================================ここまで攻撃メソッドの定義

        //=======================================================================被弾メソッドの定義
        public function tookDamage($damage)
        {
            $this->hitPoint -= $damage;
            
            if ($this->hitPoint < 0) {
                $this->hitPoint = 0;
            }
        }
        //=======================================================================ここまで被弾メソッドの定義
    }

?>